# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# Пример:

# - 6 -> да
# - 7 -> да
# - 1 -> нет

def day_check(weekday: int) -> None:
    if (0 < weekday < 6): print('Все еще будний день :(')
    elif (5 < weekday < 8): print('Ура, выходной!')
    else: print('Это не день недели!')

day = int(input('Введите цифру, обозначающую день недели: '))
day_check(day)